{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d160d03d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#1 - Средний балл и список остающих учеников\n",
    "with open('students.txt', 'r', encoding = 'utf8') as fileprint:\n",
    "    lines = fileprint.read().split('\\n')\n",
    "    i = 0\n",
    "    s = 0\n",
    "    print('Список отстающих учеников:')\n",
    "    while i < len(lines):\n",
    "        num = int(lines[i][-1])\n",
    "        if num <= 3:\n",
    "            print(f'{lines[i][0:-2]}, оценка {lines[i][-1]}')\n",
    "        s += num\n",
    "        i += 1\n",
    "    print(f'\\nСредний балл по студентам: {round(s/len(lines), 2)}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e214a556",
   "metadata": {},
   "outputs": [],
   "source": [
    "#2 - Посчитать количество определенных слов в файле\n",
    "import re\n",
    "with open('schedule.txt', 'r', encoding = 'utf8') as file:\n",
    "    text = file.read()\n",
    "print(text, '\\n')\n",
    "sp = re.split(r'[\\t\\n ]', text)\n",
    "sp_sort = [i for i in sp if not i == '']\n",
    "lec = sp_sort.count('(лекц.)')\n",
    "pract = sp_sort.count('(практ.)')\n",
    "lab = sp_sort.count('(лаб.)')\n",
    "print('Лекций:', lec)\n",
    "print('Практических:', pract)\n",
    "print('Лабораторных:', lab)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "abd0bf33",
   "metadata": {},
   "source": [
    "Том в устройстве C не имеет метки.\n",
    " Серийный номер тома: 02C4-E1C1\n",
    "\n",
    " Содержимое папки C:\\Users\\Aleksey\\ДЗ Python\n",
    "\n",
    "08.12.2021  15:20    <DIR>          .\n",
    "05.12.2021  15:42    <DIR>          ..\n",
    "04.12.2021  12:39    <DIR>          .ipynb_checkpoints\n",
    "01.12.2021  18:52             3 182 Homework_1.ipynb\n",
    "04.12.2021  12:42             2 977 Homework_2.ipynb\n",
    "08.12.2021  15:20             7 048 Homework_3.ipynb\n",
    "07.12.2021  17:14             6 643 Homework_4.ipynb\n",
    "03.12.2021  18:36               250 schedule.txt\n",
    "03.12.2021  14:52               308 students.txt\n",
    "03.12.2021  20:11                32 test.txt\n",
    "08.12.2021  15:21             1 135 text.txt\n",
    "               8 файлов         21 575 байт\n",
    "               3 папок  361 511 608 320 байт свободно"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ec8ee6a",
   "metadata": {},
   "outputs": [],
   "source": [
    "#5 - Напишите программу, которая принимает текст и выводит два слова: наиболее часто встречающееся и самое длинное.\n",
    "import re\n",
    "\n",
    "with open('text.txt', 'w', encoding = 'utf8') as f:\n",
    "    text = input()\n",
    "    f.write(text)\n",
    "\n",
    "with open('text.txt', 'r', encoding = 'utf8') as f:\n",
    "    text_read = f.read()\n",
    "\n",
    "splitted = re.split(r'[-;,!.— ]', text_read)\n",
    "sort_sp = [i for i in splitted if not i == '']\n",
    "\n",
    "for i,j in enumerate(sort_sp):\n",
    "    print(f'Частота встречаемости слова {j}:', round(sort_sp.count(j) / len(sort_sp) * 100, 2))\n",
    "print(f'Слов в строке {i+1}')\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c077b618",
   "metadata": {},
   "source": [
    "Варкалось. Хливкие шорьки Пырялись по наве, И хрюкотали зелюки, Как мюмзики в мове.\n",
    "\n",
    "О, бойся Бармаглота, сын! Он так свирлеп и дик! А в глу́ше ры́мит исполин — Злопастный Брандашмыг!\n",
    "\n",
    "Но взял он меч, и взял он щит, Высоких полон дум. В глущобу путь его лежит Под дерево Тумтум.\n",
    "\n",
    "Он стал под дерево и ждёт. И вдруг граахнул гром — Летит ужасный Бармаглот И пылкает огнём!\n",
    "\n",
    "Раз-два, раз-два! Горит трава, Взы-взы — стрижает меч, Ува! Ува! И голова Барабардает с плеч!\n",
    "\n",
    "О светозарный мальчик мой! Ты победил в бою! О храброславленный герой, Хвалу тебе пою!\n",
    "\n",
    "Варкалось. Хливкие шорьки Пырялись по наве. И хрюкотали зелюки, Как мюмзики в мове."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bf4e3227",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
